Ran Plan for 2 projects:

1. dir: `new-product-test` workspace: `default`
1. dir: `new-product-test/my-first-config` workspace: `default`
---

### 1. dir: `new-product-test` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.configcat_organizations.my_organizations: Reading...
data.configcat_organizations.my_organizations: Read complete after 0s [id=1756473546]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_environment.forno_environment will be created
+ resource "configcat_environment" "forno_environment" {
      + color       = (known after apply)
      + description = "Forno environment for New Product Test"
      + id          = (known after apply)
      + name        = "Forno"
      + order       = 1
      + product_id  = (known after apply)
    }

  # configcat_environment.prod_environment will be created
+ resource "configcat_environment" "prod_environment" {
      + color       = (known after apply)
      + description = "Production environment for New Product Test"
      + id          = (known after apply)
      + name        = "Production"
      + order       = 0
      + product_id  = (known after apply)
    }

  # configcat_environment.staging_environment will be created
+ resource "configcat_environment" "staging_environment" {
      + color       = (known after apply)
      + description = "Staging environment for New Product Test"
      + id          = (known after apply)
      + name        = "Staging"
      + order       = 2
      + product_id  = (known after apply)
    }

  # configcat_product.my_product will be created
+ resource "configcat_product" "my_product" {
      + description     = "New Product Test Description"
      + id              = (known after apply)
      + name            = "New Product Test"
      + order           = 0
      + organization_id = "08dde66c-13ee-4775-8d51-b2bc53deb2da"
    }

  # module.my-first-config.configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "My First Config Description"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "My First Config"
      + order              = 0
      + product_id         = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ forno_environment_name   = "Forno"
+ prod_environment_name    = "Production"
+ product_name             = "New Product Test"
+ staging_environment_name = "Staging"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d new-product-test
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fnew-product-test%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d new-product-test
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 2. dir: `new-product-test/my-first-config` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/opt/homebrew/bin/terraform plan -input=false -refresh -out "/Users/caio.queiroz/.atlantis/repos/caioq/poc-configcat-atlantis/8/default/new-product-test/my-first-config/default.tfplan"' in '/Users/caio.queiroz/.atlantis/repos/caioq/poc-configcat-atlantis/8/default/new-product-test/my-first-config': exit status 1
╷
│ Error: No value for required variable
│ 
│   on main.tf line 17:
│   17: variable "product_id" {
│ 
│ The root module input variable "product_id" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on main.tf line 22:
│   22: variable "prod_environment_id" {
│ 
│ The root module input variable "prod_environment_id" is not set, and has no
│ default value. Use a -var or -var-file command line argument to provide a
│ value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on main.tf line 27:
│   27: variable "forno_environment_id" {
│ 
│ The root module input variable "forno_environment_id" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵
╷
│ Error: No value for required variable
│ 
│   on main.tf line 32:
│   32: variable "staging_environment_id" {
│ 
│ The root module input variable "staging_environment_id" is not set, and has
│ no default value. Use a -var or -var-file command line argument to provide
│ a value for this variable.
╵

```
</details>

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```